014/app/Services/EstadoService.php

SELECT `id`, `nome`
FROM `estados`
ORDER BY `nome`
---
    public function getEstados()
    {

        try {

            $estados = $this->estadoModel->select('id, nome')->orderBy('nome')->findAll();