011/app/Services/AlunoService.php

    public function create(string $nome_alu, float $nota_alu, string $cpf_alu)
    {
        $dados = [
            "nome_alu" => $nome_alu,
            "nota_alu" => $nota_alu,
            "cpf_alu" => $cpf_alu
        ];
        $aluno = $this->alunoModel->insert($dados);
---
INSERT INTO `alunos` (`nome_alu`, `nota_alu`, `cpf_alu`, `created_at`, `updated_at`) VALUES ('Joao Pedro', 50, '104.517.910-12', '2026-05-22 13:18:40', '2026-05-22 13:18:40')

    public function getById(string $alunoId)
    {
        $aluno = $this->alunoModel->find($alunoId);
---
SELECT *
FROM `alunos`
WHERE `alunos`.`id` = '1'

    public function getAll()
    {
        $aluno = $this->alunoModel->findAll();
---
SELECT *
FROM `alunos`

    public function update(string $id, string $nome_alu, float $nota_alu, string $cpf_alu)
    {
        $aluno = $this->alunoModel->find($id);
        if (!$aluno) return ["erro" => "Aluno não encontrado."];
        $dados = [
            "nome_alu" => $nome_alu,
            "nota_alu" => $nota_alu,
            "cpf_alu" => $cpf_alu
        ];
        $this->alunoModel->update($id, $dados);
---
SELECT *
FROM `alunos`
WHERE `alunos`.`id` = '1'
UPDATE `alunos` SET `nome_alu` = 'Fábio', `nota_alu` = 95, `cpf_alu` = '104.517.910-88', `updated_at` = '2026-05-22 13:20:17'
WHERE `alunos`.`id` IN ('1')