012/app/Services/EstadoService.php

SELECT *
FROM `estados`
---
    public function getEstados()
    {
        try {
            $estados = $this->estadoModel->findAll();