012/app/Services/MunicipioService.php

SELECT `id`, `nome`
FROM `municipios`
WHERE `ufid` = '35'
---
    public function getMunicipiosByEstado($estadoId)
    {
        try {
            $municipios = $this->municipioModel
                ->select('id, nome')
                ->where('ufid', $estadoId)
                ->findAll();