009/app/Controllers/Home.php

INSERT INTO `alunos` (`nome_alu`, `nota_alu`) VALUES ('Matheus', '90')
---
    public function cadastrarAluno()
    {
        $nome = $this->request->getPost('nome_alu');
        $nota = $this->request->getPost('nota_alu');

        try {
            $model = model('AlunoModel');
            $data = [
                'nome_alu' => $nome,
                'nota_alu' => $nota
            ];

            $model->save($data);