014/app/Models/ClienteModel.php

SELECT `clientes`.*, `estados`.`nome` as `estado_nome`, `municipios`.`nome` as `cidade_nome`
FROM `clientes`
LEFT JOIN `estados` ON `estados`.`id` = `clientes`.`estado_id`
LEFT JOIN `municipios` ON `municipios`.`id` = `clientes`.`cidade_id`
ORDER BY `clientes`.`id` DESC
---
    public function getAllClientes()
    {
        // Faz o JOIN para pegar o nome da cidade e do estado para a view
        return $this->select('clientes.*, estados.nome as estado_nome, municipios.nome as cidade_nome')
                    ->join('estados', 'estados.id = clientes.estado_id', 'left')
                    ->join('municipios', 'municipios.id = clientes.cidade_id', 'left')
                    ->orderBy('clientes.id', 'DESC')
                    ->findAll();